{
  "id": "trex_pteranodon_battle_001",
  "name": "T-Rex vs Pteranodon - Epic Battle",
  "description": "Trận chiến hoành tráng giữa T-Rex và Pteranodon trong rừng rậm",
  "total_duration": 160,
  "shots": [
    {
      "scene": "Mở đầu cảnh rừng rậm tươi xanh, ánh sáng yếu xuyên qua tán lá, tạo không gian bí ẩn.",
      "duration": 8
    },
    {
      "scene": "T-Rex xuất hiện bước đi uy nghi qua khu rừng, tiếng chân nặng vang vọng.",
      "duration": 8
    },
    {
      "scene": "Bầu trời sáng lên, xuất hiện một con Pteranodon lớn đang bay lượn quan sát mặt đất.",
      "duration": 8
    },
    {
      "scene": "Pteranodon phát hiện T-Rex và bắt đầu lao xuống truy đuổi.",
      "duration": 8
    },
    {
      "scene": "T-Rex hoảng loạn chạy trốn, môi trường rừng rậm với cây cối rậm rạp nhanh chóng bao quanh.",
      "duration": 8
    },
    {
      "scene": "Cận cảnh mắt T-Rex hiện rõ sự lo sợ và mồ hôi chảy trên da.",
      "duration": 8
    },
    {
      "scene": "Pteranodon quặp vuốt, bay sát theo sau T-Rex, tạo cảm giác đe dọa.",
      "duration": 8
    },
    {
      "scene": "T-Rex nhảy ngoặt tránh một cái cây lớn, chân vung mạnh tạo lớp bụi bay lên.",
      "duration": 8
    },
    {
      "scene": "Góc máy rộng, toàn cảnh T-Rex chạy thoát trong khi Pteranodon vẫn sát nút.",
      "duration": 8
    },
    {
      "scene": "T-Rex dừng lại phút chốc, quay đầu lại nhìn đối thủ, chuẩn bị phản công.",
      "duration": 8
    },
    {
      "scene": "Pteranodon lao tới với tốc độ cao, mỏ và vuốt giơ ra sẵn sàng tấn công.",
      "duration": 8
    },
    {
      "scene": "T-Rex tru lên, mở hàm rộng, màn kịch tính lên đến đỉnh điểm.",
      "duration": 8
    },
    {
      "scene": "Cận cảnh va chạm giữa mỏ Pteranodon và miệng T-Rex, ánh sáng phản chiếu khi chúng va vào nhau.",
      "duration": 8
    },
    {
      "scene": "Cuộc chiến kéo dài, di chuyển liên tục trong khu rừng với nhiều yếu tố thiên nhiên như cây cối, đá tảng.",
      "duration": 8
    },
    {
      "scene": "Pteranodon bất ngờ bị T-Rex dùng đuôi đánh trúng, mất thăng bằng nhẹ.",
      "duration": 8
    },
    {
      "scene": "T-Rex tận dụng thời cơ, gầm lên vang dội khu rừng.",
      "duration": 8
    },
    {
      "scene": "Pteranodon lùi lại, xoay người bay lên cao để tránh né.",
      "duration": 8
    },
    {
      "scene": "Khung cảnh rộng, hai con khủng long tạm thời tách xa, hít thở lấy lại sức.",
      "duration": 8
    },
    {
      "scene": "T-Rex nhìn lên trời, ánh mắt kiên quyết và không chùn bước.",
      "duration": 8
    },
    {
      "scene": "Kết thúc mở, Pteranodon bay lượn trên cao, T-Rex đứng dưới đất chuẩn bị cho lần đụng độ tiếp theo.",
      "duration": 8
    }
  ]
}
